app/controllers/common_vegetables_controller.rb

SELECT "common_vegetables".* FROM "common_vegetables"
---
  def index
    @commonvegetables = CommonVegetable.all